{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_50/kernel", "shape": [21, 1024], "dtype": "float32"}, {"name": "dense_50/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_51/kernel", "shape": [1024, 512], "dtype": "float32"}, {"name": "dense_51/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_52/kernel", "shape": [512, 256], "dtype": "float32"}, {"name": "dense_52/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_53/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_53/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_54/kernel", "shape": [128, 1], "dtype": "float32"}, {"name": "dense_54/bias", "shape": [1], "dtype": "float32"}]}]}